"use strict";
// GIT (버젼 관리 시스템)
// - 개발하다가 원하는 시점마다 깃발을 꽂고(버젼을 만들고)
// - 버젼을 자유롭게 돌아다닐 수 있다.

// - 내가 만든 버젼 뿐 아니라, 동료가 만든 버전으로 이동할 수 있고,
// - 둘 중 최신 버전으로 코드를 업데이트 할 수 있다.

// - 즉, 중간중간 save를 하는 게 버전을 만든다.! 라고 볼 수 있음.

// GIT HUB(GIT을 저장할 수 있는 공간)

// 깃 사용 (버전 관리 방식)
// - Command Line Interface (명령어를 입력해서 버전을 저장하는 방법)
// - Graphic User Interface (버튼을 클릭해서 버전관리 하는 것)

// git이란 버전관리를 뜻 하고, 프로젝트를 중간중간 save할 수 있다라는 뜻!
// - 당연히 필수!!
// - git init은 .git을 생성하여서 프로젝트가 버젼관리 대상이다!! => 라고 알려주는 명령어이다.

// 버전관리를 내 Local에서만 하면 나 밖에 쓰지 못 해.
// 그래서 모두가 사용할 수 있게 github라는 버전관리 프로그램에다가 올린다.

// git hub에 올리는 과정!

// 1. 내 컴퓨터 폴더에 이 프로젝트는 버전관리 대상이다.. 라고 명령!
// 2. 계속 코딩하면 됨.
// 3. git hub에 올리길 원하는 것만 선택한다.
// 4. 선택한 파일들을 한 덩어리로 만들고, 설명을 적어준다 (몇 버전까지 개발했고.. 뭘 수정했고.. 이런 거! )
// - 예를들면 게임 저장할 때, 지금 어디까지 했는지 설명 적어주는 것과 같음.
