"use strict";
// 자료구조 : 자료들을 저장하는 기계 => 각 기계 마다 작동하는 방식이 다름.
// 장점 : 데이터를 효율적으로 저장하고, 빠르게 처리할 수 있다.

// 즉, 각 자료들을 빠르게 처리하기 위해서 써야하는 자료구조들도 다르다.

// 자료구조의 종류(어떤 자료구조를 사용하느냐에 따라서 데이터를 빠르게 처리할 수 있다.)
// ❗️각 장점을 살려서 적재적소에 사용해야 한다❗️

// 자료구조 종류
// 1. 선형 자료구조 (6가지)
// - Array
// - Dynamic Array
// - Linked list
// - Stack
// - Queue
// - Hash table

// 2. 비선형 자료구조
// - 트리
// - 그래프

// 어떤 알고리즘을 사용하기 위해선, 특정 자료구조를 꼭 써야한다.
// 어떤 자료구조를 선택했느냐에 따라서 알고리즘도 달라짐

// 자료구조 굉장히 중요함!

// ⭐️ 알고리즘 ⭐️
// - 문제를 푸는 방법!
// - 굉장히 자주 쓰이는 방법이 있어서 패턴화를 해서, 이름을 붙였음.

// 🔴 최종 정리 🔴
// - 자료구조 : 자료들을 처리해주는 기계 (기계마다 장점이 있어서 상황마다 다른 기계를 써야 한다)
// - 알고리즘 : 문제를 푸는 방식
// - ❗️ 문제를 보고 어떤 자료구조, 알고리즘을 써야하는가..를 아는 것이 중요하다 ❗️
