"use strict";
// 트리
// 트리는 방향 그래프의 일종이다.!!!
// 즉 트리는 그래프 내부에 속한다.
// ❗️ 정점을 가리키는 간선이 하나밖에 없다 ❗️

// 트리는 계층이 있는 자료들을 표현할 때 가장 많이 사용된다.
// ex) 1. 회사의 조직도를 자료구조로 표현하고 싶어!
// 루트 노드에 회장
// 그 밑에 부장 이런식으로!
// ❗️ 디렉토리 구조 => 폴더트리 ❗️

// 즉 계층이 있는 걸 나타내고 싶을 때 tree를 사용해..!
// 그리고 어떤 연관이 있는 자료들을 연결해주고 싶을 때 그래프를 사용해..!


// 이진트리 : 정점이 최대 2개의 자식을 갖는 트리 (1개도 되고 0개도 돼!)
// - 일반 이진 트리 :
// - 완전 이진 트리 : 마지막 레벨을 제외하고 모든 정점이 채워져있는 tree 
// - 포화 이진 트리 : 모든 정점이 자식을 2개 꽉 채워서 갖고있는 tree 
// - 편향 트리 : 한 방향으로만 정점이 이루어짐. 

